"use strict";

class StatusCode {
    static 400 = 'Код ошибки: 400, Плохой, неверный запрос';
    static 401 = 'Код ошибки: 401, Не авторизован';
    static 402 = 'Код ошибки: 402, Необходима оплата';
    static 403 = 'Код ошибки: 403, Запрещено';
    static 404 = 'Код ошибки: 404, Не найдено';
    static 405 = 'Код ошибки: 405, Метод не поддерживается';
    static 406 = 'Код ошибки: 406, Неприемлемо';
    static 407 = 'Код ошибки: 407, Необходима аутентификация прокси';
    static 408 = 'Код ошибки: 408, Истекло время ожидания';
    static 409 = 'Код ошибки: 409, Конфликт';
    static 410 = 'Код ошибки: 410, Удалён';
    static 411 = 'Код ошибки: 411, Необходима длина';
    static 412 = 'Код ошибки: 412, Условие ложно';
    static 413 = 'Код ошибки: 413, Размер запроса слишком велик';
    static 414 = 'Код ошибки: 414, Запрашиваемый URI слишком длинный';
    static 415 = 'Код ошибки: 415, Неподдерживаемый тип данных';
    static 416 = 'Код ошибки: 416, Запрашиваемый диапазон не достижим';
    static 417 = 'Код ошибки: 417, Ожидаемое неприемлемо';
    static 422 = 'Код ошибки: 422, Необрабатываемый экземпляр';
    static 423 = 'Код ошибки: 423, Заблокировано';
    static 424 = 'Код ошибки: 424, Невыполненная зависимость';
    static 425 = 'Код ошибки: 425, Неупорядоченный набор';
    static 426 = 'Код ошибки: 426, Необходимо обновление';
    static 428 = 'Код ошибки: 428, Необходимо предусловие';
    static 429 = 'Код ошибки: 429, Слишком много запросов';
    static 431 = 'Код ошибки: 431, Поля заголовка запроса слишком большие';
    static 449 = 'Код ошибки: 449, Повторить с';
    static 451 = 'Код ошибки: 451, Недоступно по юридическим причинам';

    static 500 = 'Код ошибки: 500, Внутренняя ошибка сервера';
    static 501 = 'Код ошибки: 501, Не реализовано';
    static 502 = 'Код ошибки: 502, Плохой, ошибочный шлюз';
    static 503 = 'Код ошибки: 503, Сервис недоступен';
    static 504 = 'Код ошибки: 504, Шлюз не отвечает';
    static 505 = 'Код ошибки: 505, Версия HTTP не поддерживается';
    static 506 = 'Код ошибки: 506, Вариант тоже проводит согласование';
    static 507 = 'Код ошибки: 507, Переполнение хранилища';
    static 508 = 'Код ошибки: 508, Обнаружено бесконечное перенаправление';
    static 509 = 'Код ошибки: 509, Исчерпана пропускная ширина канала';
    static 510 = 'Код ошибки: 510, Не расширено';
    static 511 = 'Код ошибки: 511, Требуется сетевая аутентификация';
}

export default StatusCode;